MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS706/mcu.h
/* ADCORE3H */
/* Bitname _ADCS cannot be defined because it is used by more than one SFR */
/* Bitname _RES cannot be defined because it is used by more than one SFR */
/* Bitname _EISEL cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS6 cannot be defined because it is used by more than one SFR */
/* Bitname _RES0 cannot be defined because it is used by more than one SFR */
/* Bitname _RES1 cannot be defined because it is used by more than one SFR */
/* Bitname _EISEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _EISEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _EISEL2 cannot be defined because it is used by more than one SFR */

/* ADEIEL */
#define _EIEN0 ADEIELbits.EIEN0
#define _EIEN1 ADEIELbits.EIEN1
#define _EIEN2 ADEIELbits.EIEN2
#define _EIEN3 ADEIELbits.EIEN3
#define _EIEN4 ADEIELbits.EIEN4
#define _EIEN5 ADEIELbits.EIEN5
#define _EIEN6 ADEIELbits.EIEN6
#define _EIEN7 ADEIELbits.EIEN7
#define _EIEN8 ADEIELbits.EIEN8
#define _EIEN9 ADEIELbits.EIEN9
#define _EIEN10 ADEIELbits.EIEN10
#define _EIEN11 ADEIELbits.EIEN11
#define _EIEN12 ADEIELbits.EIEN12
#define _EIEN13 ADEIELbits.EIEN13
#define _EIEN14 ADEIELbits.EIEN14
#define _EIEN15 ADEIELbits.EIEN15

/* ADEIEH */
#define _EIEN16 ADEIEHbits.EIEN16
#define _EIEN17 ADEIEHbits.EIEN17
#define _EIEN18 ADEIEHbits.EIEN18
#define _EIEN19 ADEIEHbits.EIEN19
#define _EIEN20 ADEIEHbits.EIEN20
#define _EIEN21 ADEIEHbits.EIEN21

/* ADEISTATL */
#define _EISTAT0 ADEISTATLbits.EISTAT0
#define _EISTAT1 ADEISTATLbits.EISTAT1
#define _EISTAT2 ADEISTATLbits.EISTAT2
#define _EISTAT3 ADEISTATLbits.EISTAT3
#define _EISTAT4 ADEISTATLbits.EISTAT4
#define _EISTAT5 ADEISTATLbits.EISTAT5
#define _EISTAT6 ADEISTATLbits.EISTAT6
#define _EISTAT7 ADEISTATLbits.EISTAT7
#define _EISTAT8 ADEISTATLbits.EISTAT8
#define _EISTAT9 ADEISTATLbits.EISTAT9
#define _EISTAT10 ADEISTATLbits.EISTAT10
#define _EISTAT11 ADEISTATLbits.EISTAT11
#define _EISTAT12 ADEISTATLbits.EISTAT12
#define _EISTAT13 ADEISTATLbits.EISTAT13
#define _EISTAT14 ADEISTATLbits.EISTAT14
#define _EISTAT15 ADEISTATLbits.EISTAT15

/* ADEISTATH */
#define _EISTAT16 ADEISTATHbits.EISTAT16
#define _EISTAT17 ADEISTATHbits.EISTAT17
#define _EISTAT18 ADEISTATHbits.EISTAT18
#define _EISTAT19 ADEISTATHbits.EISTAT19
#define _EISTAT20 ADEISTATHbits.EISTAT20
#define _EISTAT21 ADEISTATHbits.EISTAT21

/* ADCON5L */
#define _C0PWR ADCON5Lbits.C0PWR
#define _C1PWR ADCON5Lbits.C1PWR
#define _C2PWR ADCON5Lbits.C2PWR
#define _C3PWR ADCON5Lbits.C3PWR
#define _SHRPWR ADCON5Lbits.SHRPWR
#define _C0RDY ADCON5Lbits.C0RDY
#define _C1RDY ADCON5Lbits.C1RDY
#define _C2RDY ADCON5Lbits.C2RDY
#define _C3RDY ADCON5Lbits.C3RDY
#define _SHRRDY ADCON5Lbits.SHRRDY

/* ADCON5H */
#define _C0CIE ADCON5Hbits.C0CIE
#define _C1CIE ADCON5Hbits.C1CIE
#define _C2CIE ADCON5Hbits.C2CIE
#define _C3CIE ADCON5Hbits.C3CIE
#define _SHRCIE ADCON5Hbits.SHRCIE
#define _WARMTIME ADCON5Hbits.WARMTIME
#define _C0C1E ADCON5Hbits.C0C1E
#define _C1C1E ADCON5Hbits.C1C1E
#define _C2C1E ADCON5Hbits.C2C1E
#define _C3C1E ADCON5Hbits.C3C1E

/* ADCAL0L */
#define _CAL0RUN ADCAL0Lbits.CAL0RUN
#define _CAL0EN ADCAL0Lbits.CAL0EN
#define _CAL0DIFF ADCAL0Lbits.CAL0DIFF
#define _CAL0SKIP ADCAL0Lbits.CAL0SKIP
#define _CAL0RDY ADCAL0Lbits.CAL0RDY
#define _CAL1RUN ADCAL0Lbits.CAL1RUN
#define _CAL1EN ADCAL0Lbits.CAL1EN
#define _CAL1DIFF ADCAL0Lbits.CAL1DIFF
#define _CAL1SKIP ADCAL0Lbits.CAL1SKIP
#define _CAL1RDY ADCAL0Lbits.CAL1RDY

/* ADCAL0H */
#define _CAL2RUN ADCAL0Hbits.CAL2RUN
#define _CAL2EN ADCAL0Hbits.CAL2EN
#define _CAL2DIFF ADCAL0Hbits.CAL2DIFF
#define _CAL2SKIP ADCAL0Hbits.CAL2SKIP
#define _CAL2RDY ADCAL0Hbits.CAL2RDY
#define _CAL3RUN ADCAL0Hbits.CAL3RUN
#define _CAL3EN ADCAL0Hbits.CAL3EN
#define _CAL3DIFF ADCAL0Hbits.CAL3DIFF
#define _CAL3SKIP ADCAL0Hbits.CAL3SKIP
#define _CAL3RDY ADCAL0Hbits.CAL3RDY

/* ADCAL1H */
#define _CSHRRUN ADCAL1Hbits.CSHRRUN
#define _CSHREN ADCAL1Hbits.CSHREN
#define _CSHRDIFF ADCAL1Hbits.CSHRDIFF
#define _CSHRSKIP ADCAL1Hbits.CSHRSKIP
#define _CSHRRDY ADCAL1Hbits.CSHRRDY

/* ISRCCON */
#define _ISRCCAL ISRCCONbits.ISRCCAL
#define _OUTSEL ISRCCONbits.OUTSEL
#define _ISRCEN ISRCCONbits.ISRCEN
#define _ISRCCAL0 ISRCCONbits.ISRCCAL0
#define _ISRCCAL1 ISRCCONbits.ISRCCAL1
#define _ISRCCAL2 ISRCCONbits.ISRCCAL2
#define _ISRCCAL3 ISRCCONbits.ISRCCAL3
#define _ISRCCAL4 ISRCCONbits.ISRCCAL4
#define _ISRCCAL5 ISRCCONbits.ISRCCAL5
#define _OUTSEL0 ISRCCONbits.OUTSEL0
#define _OUTSEL1 ISRCCONbits.OUTSEL1
#define _OUTSEL2 ISRCCONbits.OUTSEL2

/* PGA1CON */
/* Bitname _GAIN cannot be defined because it is used by more than one SFR */
/* Bitname _SELNI cannot be defined because it is used by more than one SFR */
/* Bitname _SELPI cannot be defined because it is used by more than one SFR */
/* Bitname _PGAOEN cannot be defined because it is used by more than one SFR */
/* Bitname _PGAEN cannot be defined because it is used by more than one SFR */
/* Bitname _GAIN0 cannot be defined because it is used by more than one SFR */
/* Bitname _GAIN1 cannot be defined because it is used by more than one SFR */
/* Bitname _GAIN2 cannot be defined because it is used by more than one SFR */
/* Bitname _SELNI0 cannot be defined because it is used by more than one SFR */
/* Bitname _SELNI1 cannot be defined because it is used by more than one SFR */
/* Bitname _SELNI2 cannot be defined because it is used by more than one SFR */
/* Bitname _SELPI0 cannot be defined because it is used by more than one SFR */
/* Bitname _SELPI1 cannot be defined because it is used by more than one SFR */
/* Bitname _SELPI2 cannot be defined because it is used by more than one SFR */

