MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS706/mcu.h
/* IPC13 */
#define _INT4IP IPC13bits.INT4IP
#define _INT4IP0 IPC13bits.INT4IP0
#define _INT4IP1 IPC13bits.INT4IP1
#define _INT4IP2 IPC13bits.INT4IP2

/* IPC14 */
#define _PSEMIP IPC14bits.PSEMIP
#define _PSEMIP0 IPC14bits.PSEMIP0
#define _PSEMIP1 IPC14bits.PSEMIP1
#define _PSEMIP2 IPC14bits.PSEMIP2

/* IPC16 */
#define _U1EIP IPC16bits.U1EIP
#define _U2EIP IPC16bits.U2EIP
#define _U1EIP0 IPC16bits.U1EIP0
#define _U1EIP1 IPC16bits.U1EIP1
#define _U1EIP2 IPC16bits.U1EIP2
#define _U2EIP0 IPC16bits.U2EIP0
#define _U2EIP1 IPC16bits.U2EIP1
#define _U2EIP2 IPC16bits.U2EIP2

/* IPC18 */
#define _PSESIP IPC18bits.PSESIP
#define _PSESIP0 IPC18bits.PSESIP0
#define _PSESIP1 IPC18bits.PSESIP1
#define _PSESIP2 IPC18bits.PSESIP2

/* IPC22 */
#define _SPI3TXIP IPC22bits.SPI3TXIP
#define _SPI3RXIP IPC22bits.SPI3RXIP
#define _SPI3TXIP0 IPC22bits.SPI3TXIP0
#define _SPI3TXIP1 IPC22bits.SPI3TXIP1
#define _SPI3TXIP2 IPC22bits.SPI3TXIP2
#define _SPI3RXIP0 IPC22bits.SPI3RXIP0
#define _SPI3RXIP1 IPC22bits.SPI3RXIP1
#define _SPI3RXIP2 IPC22bits.SPI3RXIP2

/* IPC23 */
#define _PWM1IP IPC23bits.PWM1IP
#define _PWM2IP IPC23bits.PWM2IP
#define _PWM1IP0 IPC23bits.PWM1IP0
#define _PWM1IP1 IPC23bits.PWM1IP1
#define _PWM1IP2 IPC23bits.PWM1IP2
#define _PWM2IP0 IPC23bits.PWM2IP0
#define _PWM2IP1 IPC23bits.PWM2IP1
#define _PWM2IP2 IPC23bits.PWM2IP2

/* IPC24 */
#define _PWM3IP IPC24bits.PWM3IP
#define _PWM4IP IPC24bits.PWM4IP
#define _PWM5IP IPC24bits.PWM5IP
#define _PWM6IP IPC24bits.PWM6IP
#define _PWM3IP0 IPC24bits.PWM3IP0
#define _PWM3IP1 IPC24bits.PWM3IP1
#define _PWM3IP2 IPC24bits.PWM3IP2
#define _PWM4IP0 IPC24bits.PWM4IP0
#define _PWM4IP1 IPC24bits.PWM4IP1
#define _PWM4IP2 IPC24bits.PWM4IP2
#define _PWM5IP0 IPC24bits.PWM5IP0
#define _PWM5IP1 IPC24bits.PWM5IP1
#define _PWM5IP2 IPC24bits.PWM5IP2
#define _PWM6IP0 IPC24bits.PWM6IP0
#define _PWM6IP1 IPC24bits.PWM6IP1
#define _PWM6IP2 IPC24bits.PWM6IP2

/* IPC25 */
#define _PWM7IP IPC25bits.PWM7IP
#define _PWM8IP IPC25bits.PWM8IP
#define _AC2IP IPC25bits.AC2IP
#define _PWM7IP0 IPC25bits.PWM7IP0
#define _PWM7IP1 IPC25bits.PWM7IP1
#define _PWM7IP2 IPC25bits.PWM7IP2
#define _PWM8IP0 IPC25bits.PWM8IP0
#define _PWM8IP1 IPC25bits.PWM8IP1
#define _PWM8IP2 IPC25bits.PWM8IP2
#define _AC2IP0 IPC25bits.AC2IP0
#define _AC2IP1 IPC25bits.AC2IP1
#define _AC2IP2 IPC25bits.AC2IP2
#define _CMP2IP IPC25bits.CMP2IP
#define _CMP2IP0 IPC25bits.CMP2IP0
#define _CMP2IP1 IPC25bits.CMP2IP1
#define _CMP2IP2 IPC25bits.CMP2IP2

/* IPC26 */
#define _AC3IP IPC26bits.AC3IP
#define _AC4IP IPC26bits.AC4IP
#define _AC3IP0 IPC26bits.AC3IP0
#define _AC3IP1 IPC26bits.AC3IP1
#define _AC3IP2 IPC26bits.AC3IP2
#define _AC4IP0 IPC26bits.AC4IP0
#define _AC4IP1 IPC26bits.AC4IP1
#define _AC4IP2 IPC26bits.AC4IP2
#define _CMP3IP IPC26bits.CMP3IP
#define _CMP4IP IPC26bits.CMP4IP
#define _CMP3IP0 IPC26bits.CMP3IP0
#define _CMP3IP1 IPC26bits.CMP3IP1
#define _CMP3IP2 IPC26bits.CMP3IP2
#define _CMP4IP0 IPC26bits.CMP4IP0
#define _CMP4IP1 IPC26bits.CMP4IP1
#define _CMP4IP2 IPC26bits.CMP4IP2

/* IPC27 */
#define _ADCAN0IP IPC27bits.ADCAN0IP
#define _ADCAN1IP IPC27bits.ADCAN1IP
#define _ADCAN0IP0 IPC27bits.ADCAN0IP0
#define _ADCAN0IP1 IPC27bits.ADCAN0IP1
#define _ADCAN0IP2 IPC27bits.ADCAN0IP2
#define _ADCAN1IP0 IPC27bits.ADCAN1IP0
#define _ADCAN1IP1 IPC27bits.ADCAN1IP1
#define _ADCAN1IP2 IPC27bits.ADCAN1IP2

/* IPC28 */
#define _ADCAN2IP IPC28bits.ADCAN2IP
#define _ADCAN3IP IPC28bits.ADCAN3IP
#define _ADCAN4IP IPC28bits.ADCAN4IP
#define _ADCAN5IP IPC28bits.ADCAN5IP
#define _ADCAN2IP0 IPC28bits.ADCAN2IP0
#define _ADCAN2IP1 IPC28bits.ADCAN2IP1
#define _ADCAN2IP2 IPC28bits.ADCAN2IP2
#define _ADCAN3IP0 IPC28bits.ADCAN3IP0
#define _ADCAN3IP1 IPC28bits.ADCAN3IP1
#define _ADCAN3IP2 IPC28bits.ADCAN3IP2
#define _ADCAN4IP0 IPC28bits.ADCAN4IP0
#define _ADCAN4IP1 IPC28bits.ADCAN4IP1
#define _ADCAN4IP2 IPC28bits.ADCAN4IP2
#define _ADCAN5IP0 IPC28bits.ADCAN5IP0
#define _ADCAN5IP1 IPC28bits.ADCAN5IP1
#define _ADCAN5IP2 IPC28bits.ADCAN5IP2

/* IPC29 */
#define _ADCAN6IP IPC29bits.ADCAN6IP
#define _ADCAN7IP IPC29bits.ADCAN7IP
#define _ADCAN6IP0 IPC29bits.ADCAN6IP0
#define _ADCAN6IP1 IPC29bits.ADCAN6IP1
#define _ADCAN6IP2 IPC29bits.ADCAN6IP2
#define _ADCAN7IP0 IPC29bits.ADCAN7IP0
#define _ADCAN7IP1 IPC29bits.ADCAN7IP1
#define _ADCAN7IP2 IPC29bits.ADCAN7IP2

/* IPC31 */
#define _SPI1EIP IPC31bits.SPI1EIP
#define _SPI2EIP IPC31bits.SPI2EIP
#define _SPI3EIP IPC31bits.SPI3EIP
#define _SPI1EIP0 IPC31bits.SPI1EIP0
#define _SPI1EIP1 IPC31bits.SPI1EIP1
#define _SPI1EIP2 IPC31bits.SPI1EIP2
#define _SPI2EIP0 IPC31bits.SPI2EIP0
#define _SPI2EIP1 IPC31bits.SPI2EIP1
#define _SPI2EIP2 IPC31bits.SPI2EIP2
#define _SPI3EIP0 IPC31bits.SPI3EIP0
#define _SPI3EIP1 IPC31bits.SPI3EIP1
#define _SPI3EIP2 IPC31bits.SPI3EIP2

/* IPC34 */
#define _CLC1IP IPC34bits.CLC1IP
#define _CLC2IP IPC34bits.CLC2IP
#define _CLC1IP0 IPC34bits.CLC1IP0
#define _CLC1IP1 IPC34bits.CLC1IP1
#define _CLC1IP2 IPC34bits.CLC1IP2
#define _CLC2IP0 IPC34bits.CLC2IP0
#define _CLC2IP1 IPC34bits.CLC2IP1
#define _CLC2IP2 IPC34bits.CLC2IP2

/* IPC35 */
#define _CLC3IP IPC35bits.CLC3IP
#define _CLC4IP IPC35bits.CLC4IP
#define _ICDIP IPC35bits.ICDIP
#define _JTAGIP IPC35bits.JTAGIP
#define _CLC3IP0 IPC35bits.CLC3IP0
#define _CLC3IP1 IPC35bits.CLC3IP1
#define _CLC3IP2 IPC35bits.CLC3IP2
#define _CLC4IP0 IPC35bits.CLC4IP0
#define _CLC4IP1 IPC35bits.CLC4IP1
#define _CLC4IP2 IPC35bits.CLC4IP2
#define _ICDIP0 IPC35bits.ICDIP0
#define _ICDIP1 IPC35bits.ICDIP1
#define _ICDIP2 IPC35bits.ICDIP2
#define _JTAGIP0 IPC35bits.JTAGIP0
#define _JTAGIP1 IPC35bits.JTAGIP1
#define _JTAGIP2 IPC35bits.JTAGIP2

/* IPC36 */
#define _PTGSTEPIP IPC36bits.PTGSTEPIP
#define _PTGWDTIP IPC36bits.PTGWDTIP
#define _PTG0IP IPC36bits.PTG0IP
#define _PTGSTEP0 IPC36bits.PTGSTEP0
#define _PTGSTEP1 IPC36bits.PTGSTEP1
#define _PTGSTEP2 IPC36bits.PTGSTEP2
#define _PTGWDTP0 IPC36bits.PTGWDTP0
#define _PTGWDTP1 IPC36bits.PTGWDTP1
#define _PTGWDTP2 IPC36bits.PTGWDTP2
#define _PTGP0 IPC36bits.PTGP0
#define _PTG0P1 IPC36bits.PTG0P1
#define _PTG0P2 IPC36bits.PTG0P2

/* IPC37 */
#define _PTG1IP IPC37bits.PTG1IP
#define _PTG2IP IPC37bits.PTG2IP
#define _PTG3IP IPC37bits.PTG3IP
#define _ADCAN8IP IPC37bits.ADCAN8IP
#define _PTG1P0 IPC37bits.PTG1P0
#define _PTG1P1 IPC37bits.PTG1P1
#define _PTG1P2 IPC37bits.PTG1P2
#define _PTG2P0 IPC37bits.PTG2P0
#define _PTG2P1 IPC37bits.PTG2P1
#define _PTG2P2 IPC37bits.PTG2P2
#define _PTG3P0 IPC37bits.PTG3P0
#define _PTG3P1 IPC37bits.PTG3P1
#define _PTG3P2 IPC37bits.PTG3P2
#define _ADCAN8IP0 IPC37bits.ADCAN8IP0
#define _ADCAN8IP1 IPC37bits.ADCAN8IP1
#define _ADCAN8IP2 IPC37bits.ADCAN8IP2

/* IPC38 */
#define _ADCAN9IP IPC38bits.ADCAN9IP
#define _ADCAN10IP IPC38bits.ADCAN10IP
#define _ADCAN11IP IPC38bits.ADCAN11IP
#define _ADCAN12IP IPC38bits.ADCAN12IP
#define _ADCAN9IP0 IPC38bits.ADCAN9IP0
#define _ADCAN9IP1 IPC38bits.ADCAN9IP1
#define _ADCAN9IP2 IPC38bits.ADCAN9IP2
#define _ADCAN10IP0 IPC38bits.ADCAN10IP0
#define _ADCAN10IP1 IPC38bits.ADCAN10IP1
#define _ADCAN10IP2 IPC38bits.ADCAN10IP2
#define _ADCAN11IP0 IPC38bits.ADCAN11IP0
#define _ADCAN11IP1 IPC38bits.ADCAN11IP1
#define _ADCAN11IP2 IPC38bits.ADCAN11IP2
#define _ADCAN12IP0 IPC38bits.ADCAN12IP0
#define _ADCAN12IP1 IPC38bits.ADCAN12IP1
#define _ADCAN12IP2 IPC38bits.ADCAN12IP2

