MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS706/mcu.h
#define _ADTRIG2H_TRIGSRC102_POSITION            0x00000002
#define _ADTRIG2H_TRIGSRC102_MASK                0x00000004
#define _ADTRIG2H_TRIGSRC102_LENGTH              0x00000001

#define _ADTRIG2H_TRIGSRC103_POSITION            0x00000003
#define _ADTRIG2H_TRIGSRC103_MASK                0x00000008
#define _ADTRIG2H_TRIGSRC103_LENGTH              0x00000001

#define _ADTRIG2H_TRIGSRC104_POSITION            0x00000004
#define _ADTRIG2H_TRIGSRC104_MASK                0x00000010
#define _ADTRIG2H_TRIGSRC104_LENGTH              0x00000001

#define _ADTRIG2H_TRGSRC110_POSITION             0x00000008
#define _ADTRIG2H_TRGSRC110_MASK                 0x00000100
#define _ADTRIG2H_TRGSRC110_LENGTH               0x00000001

#define _ADTRIG2H_TRGSRC111_POSITION             0x00000009
#define _ADTRIG2H_TRGSRC111_MASK                 0x00000200
#define _ADTRIG2H_TRGSRC111_LENGTH               0x00000001

#define _ADTRIG2H_TRGSRC112_POSITION             0x0000000A
#define _ADTRIG2H_TRGSRC112_MASK                 0x00000400
#define _ADTRIG2H_TRGSRC112_LENGTH               0x00000001

#define _ADTRIG2H_TRGSRC113_POSITION             0x0000000B
#define _ADTRIG2H_TRGSRC113_MASK                 0x00000800
#define _ADTRIG2H_TRGSRC113_LENGTH               0x00000001

#define _ADTRIG2H_TRGSRC114_POSITION             0x0000000C
#define _ADTRIG2H_TRGSRC114_MASK                 0x00001000
#define _ADTRIG2H_TRGSRC114_LENGTH               0x00000001

#define _ADTRIG2H_TRGSRC100_POSITION             0x00000000
#define _ADTRIG2H_TRGSRC100_MASK                 0x00000001
#define _ADTRIG2H_TRGSRC100_LENGTH               0x00000001

#define _ADTRIG2H_TRGSRC101_POSITION             0x00000001
#define _ADTRIG2H_TRGSRC101_MASK                 0x00000002
#define _ADTRIG2H_TRGSRC101_LENGTH               0x00000001

#define _ADTRIG2H_TRGSRC102_POSITION             0x00000002
#define _ADTRIG2H_TRGSRC102_MASK                 0x00000004
#define _ADTRIG2H_TRGSRC102_LENGTH               0x00000001

#define _ADTRIG2H_TRGSRC103_POSITION             0x00000003
#define _ADTRIG2H_TRGSRC103_MASK                 0x00000008
#define _ADTRIG2H_TRGSRC103_LENGTH               0x00000001

#define _ADTRIG2H_TRGSRC104_POSITION             0x00000004
#define _ADTRIG2H_TRGSRC104_MASK                 0x00000010
#define _ADTRIG2H_TRGSRC104_LENGTH               0x00000001

#define _ADTRIG3L_TRGSRC12_POSITION              0x00000000
#define _ADTRIG3L_TRGSRC12_MASK                  0x0000001F
#define _ADTRIG3L_TRGSRC12_LENGTH                0x00000005

#define _ADTRIG3L_TRGSRC13_POSITION              0x00000008
#define _ADTRIG3L_TRGSRC13_MASK                  0x00001F00
#define _ADTRIG3L_TRGSRC13_LENGTH                0x00000005

#define _ADTRIG3L_TRIGSRC120_POSITION            0x00000000
#define _ADTRIG3L_TRIGSRC120_MASK                0x00000001
#define _ADTRIG3L_TRIGSRC120_LENGTH              0x00000001

#define _ADTRIG3L_TRIGSRC121_POSITION            0x00000001
#define _ADTRIG3L_TRIGSRC121_MASK                0x00000002
#define _ADTRIG3L_TRIGSRC121_LENGTH              0x00000001

#define _ADTRIG3L_TRIGSRC122_POSITION            0x00000002
#define _ADTRIG3L_TRIGSRC122_MASK                0x00000004
#define _ADTRIG3L_TRIGSRC122_LENGTH              0x00000001

#define _ADTRIG3L_TRIGSRC123_POSITION            0x00000003
#define _ADTRIG3L_TRIGSRC123_MASK                0x00000008
#define _ADTRIG3L_TRIGSRC123_LENGTH              0x00000001

#define _ADTRIG3L_TRIGSRC124_POSITION            0x00000004
#define _ADTRIG3L_TRIGSRC124_MASK                0x00000010
#define _ADTRIG3L_TRIGSRC124_LENGTH              0x00000001

#define _ADTRIG3L_TRGSRC130_POSITION             0x00000008
#define _ADTRIG3L_TRGSRC130_MASK                 0x00000100
#define _ADTRIG3L_TRGSRC130_LENGTH               0x00000001

#define _ADTRIG3L_TRGSRC131_POSITION             0x00000009
#define _ADTRIG3L_TRGSRC131_MASK                 0x00000200
#define _ADTRIG3L_TRGSRC131_LENGTH               0x00000001

#define _ADTRIG3L_TRGSRC132_POSITION             0x0000000A
#define _ADTRIG3L_TRGSRC132_MASK                 0x00000400
#define _ADTRIG3L_TRGSRC132_LENGTH               0x00000001

#define _ADTRIG3L_TRGSRC133_POSITION             0x0000000B
#define _ADTRIG3L_TRGSRC133_MASK                 0x00000800
#define _ADTRIG3L_TRGSRC133_LENGTH               0x00000001

#define _ADTRIG3L_TRGSRC134_POSITION             0x0000000C
#define _ADTRIG3L_TRGSRC134_MASK                 0x00001000
#define _ADTRIG3L_TRGSRC134_LENGTH               0x00000001

#define _ADTRIG3L_TRGSRC120_POSITION             0x00000000
#define _ADTRIG3L_TRGSRC120_MASK                 0x00000001
#define _ADTRIG3L_TRGSRC120_LENGTH               0x00000001

#define _ADTRIG3L_TRGSRC121_POSITION             0x00000001
#define _ADTRIG3L_TRGSRC121_MASK                 0x00000002
#define _ADTRIG3L_TRGSRC121_LENGTH               0x00000001

#define _ADTRIG3L_TRGSRC122_POSITION             0x00000002
#define _ADTRIG3L_TRGSRC122_MASK                 0x00000004
#define _ADTRIG3L_TRGSRC122_LENGTH               0x00000001

#define _ADTRIG3L_TRGSRC123_POSITION             0x00000003
#define _ADTRIG3L_TRGSRC123_MASK                 0x00000008
#define _ADTRIG3L_TRGSRC123_LENGTH               0x00000001

#define _ADTRIG3L_TRGSRC124_POSITION             0x00000004
#define _ADTRIG3L_TRGSRC124_MASK                 0x00000010
#define _ADTRIG3L_TRGSRC124_LENGTH               0x00000001

#define _ADTRIG3H_TRGSRC14_POSITION              0x00000000
#define _ADTRIG3H_TRGSRC14_MASK                  0x0000001F
#define _ADTRIG3H_TRGSRC14_LENGTH                0x00000005

#define _ADTRIG3H_TRGSRC15_POSITION              0x00000008
#define _ADTRIG3H_TRGSRC15_MASK                  0x00001F00
#define _ADTRIG3H_TRGSRC15_LENGTH                0x00000005

#define _ADTRIG3H_TRIGSRC140_POSITION            0x00000000
#define _ADTRIG3H_TRIGSRC140_MASK                0x00000001
#define _ADTRIG3H_TRIGSRC140_LENGTH              0x00000001

#define _ADTRIG3H_TRIGSRC141_POSITION            0x00000001
#define _ADTRIG3H_TRIGSRC141_MASK                0x00000002
#define _ADTRIG3H_TRIGSRC141_LENGTH              0x00000001

#define _ADTRIG3H_TRIGSRC142_POSITION            0x00000002
#define _ADTRIG3H_TRIGSRC142_MASK                0x00000004
#define _ADTRIG3H_TRIGSRC142_LENGTH              0x00000001

#define _ADTRIG3H_TRIGSRC143_POSITION            0x00000003
#define _ADTRIG3H_TRIGSRC143_MASK                0x00000008
#define _ADTRIG3H_TRIGSRC143_LENGTH              0x00000001

