MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS706/mcu.h
#define _ADTRIG3H_TRIGSRC144_POSITION            0x00000004
#define _ADTRIG3H_TRIGSRC144_MASK                0x00000010
#define _ADTRIG3H_TRIGSRC144_LENGTH              0x00000001

#define _ADTRIG3H_TRGSRC150_POSITION             0x00000008
#define _ADTRIG3H_TRGSRC150_MASK                 0x00000100
#define _ADTRIG3H_TRGSRC150_LENGTH               0x00000001

#define _ADTRIG3H_TRGSRC151_POSITION             0x00000009
#define _ADTRIG3H_TRGSRC151_MASK                 0x00000200
#define _ADTRIG3H_TRGSRC151_LENGTH               0x00000001

#define _ADTRIG3H_TRGSRC152_POSITION             0x0000000A
#define _ADTRIG3H_TRGSRC152_MASK                 0x00000400
#define _ADTRIG3H_TRGSRC152_LENGTH               0x00000001

#define _ADTRIG3H_TRGSRC153_POSITION             0x0000000B
#define _ADTRIG3H_TRGSRC153_MASK                 0x00000800
#define _ADTRIG3H_TRGSRC153_LENGTH               0x00000001

#define _ADTRIG3H_TRGSRC154_POSITION             0x0000000C
#define _ADTRIG3H_TRGSRC154_MASK                 0x00001000
#define _ADTRIG3H_TRGSRC154_LENGTH               0x00000001

#define _ADTRIG3H_TRGSRC140_POSITION             0x00000000
#define _ADTRIG3H_TRGSRC140_MASK                 0x00000001
#define _ADTRIG3H_TRGSRC140_LENGTH               0x00000001

#define _ADTRIG3H_TRGSRC141_POSITION             0x00000001
#define _ADTRIG3H_TRGSRC141_MASK                 0x00000002
#define _ADTRIG3H_TRGSRC141_LENGTH               0x00000001

#define _ADTRIG3H_TRGSRC142_POSITION             0x00000002
#define _ADTRIG3H_TRGSRC142_MASK                 0x00000004
#define _ADTRIG3H_TRGSRC142_LENGTH               0x00000001

#define _ADTRIG3H_TRGSRC143_POSITION             0x00000003
#define _ADTRIG3H_TRGSRC143_MASK                 0x00000008
#define _ADTRIG3H_TRGSRC143_LENGTH               0x00000001

#define _ADTRIG3H_TRGSRC144_POSITION             0x00000004
#define _ADTRIG3H_TRGSRC144_MASK                 0x00000010
#define _ADTRIG3H_TRGSRC144_LENGTH               0x00000001

#define _ADTRIG4L_TRGSRC16_POSITION              0x00000000
#define _ADTRIG4L_TRGSRC16_MASK                  0x0000001F
#define _ADTRIG4L_TRGSRC16_LENGTH                0x00000005

#define _ADTRIG4L_TRGSRC17_POSITION              0x00000008
#define _ADTRIG4L_TRGSRC17_MASK                  0x00001F00
#define _ADTRIG4L_TRGSRC17_LENGTH                0x00000005

#define _ADTRIG4L_TRIGSRC160_POSITION            0x00000000
#define _ADTRIG4L_TRIGSRC160_MASK                0x00000001
#define _ADTRIG4L_TRIGSRC160_LENGTH              0x00000001

#define _ADTRIG4L_TRIGSRC161_POSITION            0x00000001
#define _ADTRIG4L_TRIGSRC161_MASK                0x00000002
#define _ADTRIG4L_TRIGSRC161_LENGTH              0x00000001

#define _ADTRIG4L_TRIGSRC162_POSITION            0x00000002
#define _ADTRIG4L_TRIGSRC162_MASK                0x00000004
#define _ADTRIG4L_TRIGSRC162_LENGTH              0x00000001

#define _ADTRIG4L_TRIGSRC163_POSITION            0x00000003
#define _ADTRIG4L_TRIGSRC163_MASK                0x00000008
#define _ADTRIG4L_TRIGSRC163_LENGTH              0x00000001

#define _ADTRIG4L_TRIGSRC164_POSITION            0x00000004
#define _ADTRIG4L_TRIGSRC164_MASK                0x00000010
#define _ADTRIG4L_TRIGSRC164_LENGTH              0x00000001

#define _ADTRIG4L_TRGSRC170_POSITION             0x00000008
#define _ADTRIG4L_TRGSRC170_MASK                 0x00000100
#define _ADTRIG4L_TRGSRC170_LENGTH               0x00000001

#define _ADTRIG4L_TRGSRC171_POSITION             0x00000009
#define _ADTRIG4L_TRGSRC171_MASK                 0x00000200
#define _ADTRIG4L_TRGSRC171_LENGTH               0x00000001

#define _ADTRIG4L_TRGSRC172_POSITION             0x0000000A
#define _ADTRIG4L_TRGSRC172_MASK                 0x00000400
#define _ADTRIG4L_TRGSRC172_LENGTH               0x00000001

#define _ADTRIG4L_TRGSRC173_POSITION             0x0000000B
#define _ADTRIG4L_TRGSRC173_MASK                 0x00000800
#define _ADTRIG4L_TRGSRC173_LENGTH               0x00000001

#define _ADTRIG4L_TRGSRC174_POSITION             0x0000000C
#define _ADTRIG4L_TRGSRC174_MASK                 0x00001000
#define _ADTRIG4L_TRGSRC174_LENGTH               0x00000001

#define _ADTRIG4L_TRGSRC160_POSITION             0x00000000
#define _ADTRIG4L_TRGSRC160_MASK                 0x00000001
#define _ADTRIG4L_TRGSRC160_LENGTH               0x00000001

#define _ADTRIG4L_TRGSRC161_POSITION             0x00000001
#define _ADTRIG4L_TRGSRC161_MASK                 0x00000002
#define _ADTRIG4L_TRGSRC161_LENGTH               0x00000001

#define _ADTRIG4L_TRGSRC162_POSITION             0x00000002
#define _ADTRIG4L_TRGSRC162_MASK                 0x00000004
#define _ADTRIG4L_TRGSRC162_LENGTH               0x00000001

#define _ADTRIG4L_TRGSRC163_POSITION             0x00000003
#define _ADTRIG4L_TRGSRC163_MASK                 0x00000008
#define _ADTRIG4L_TRGSRC163_LENGTH               0x00000001

#define _ADTRIG4L_TRGSRC164_POSITION             0x00000004
#define _ADTRIG4L_TRGSRC164_MASK                 0x00000010
#define _ADTRIG4L_TRGSRC164_LENGTH               0x00000001

#define _ADTRIG4H_TRGSRC18_POSITION              0x00000000
#define _ADTRIG4H_TRGSRC18_MASK                  0x0000001F
#define _ADTRIG4H_TRGSRC18_LENGTH                0x00000005

#define _ADTRIG4H_TRGSRC19_POSITION              0x00000008
#define _ADTRIG4H_TRGSRC19_MASK                  0x00001F00
#define _ADTRIG4H_TRGSRC19_LENGTH                0x00000005

#define _ADTRIG4H_TRIGSRC180_POSITION            0x00000000
#define _ADTRIG4H_TRIGSRC180_MASK                0x00000001
#define _ADTRIG4H_TRIGSRC180_LENGTH              0x00000001

#define _ADTRIG4H_TRIGSRC181_POSITION            0x00000001
#define _ADTRIG4H_TRIGSRC181_MASK                0x00000002
#define _ADTRIG4H_TRIGSRC181_LENGTH              0x00000001

#define _ADTRIG4H_TRIGSRC182_POSITION            0x00000002
#define _ADTRIG4H_TRIGSRC182_MASK                0x00000004
#define _ADTRIG4H_TRIGSRC182_LENGTH              0x00000001

#define _ADTRIG4H_TRIGSRC183_POSITION            0x00000003
#define _ADTRIG4H_TRIGSRC183_MASK                0x00000008
#define _ADTRIG4H_TRIGSRC183_LENGTH              0x00000001

#define _ADTRIG4H_TRIGSRC184_POSITION            0x00000004
#define _ADTRIG4H_TRIGSRC184_MASK                0x00000010
#define _ADTRIG4H_TRIGSRC184_LENGTH              0x00000001

#define _ADTRIG4H_TRGSRC190_POSITION             0x00000008
#define _ADTRIG4H_TRGSRC190_MASK                 0x00000100
#define _ADTRIG4H_TRGSRC190_LENGTH               0x00000001

#define _ADTRIG4H_TRGSRC191_POSITION             0x00000009
#define _ADTRIG4H_TRGSRC191_MASK                 0x00000200
#define _ADTRIG4H_TRGSRC191_LENGTH               0x00000001

#define _ADTRIG4H_TRGSRC192_POSITION             0x0000000A
#define _ADTRIG4H_TRGSRC192_MASK                 0x00000400
#define _ADTRIG4H_TRGSRC192_LENGTH               0x00000001

