MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS706/mcu.h
#define _RPOR4_RP35R_POSITION                    0x00000000
#define _RPOR4_RP35R_MASK                        0x0000007F
#define _RPOR4_RP35R_LENGTH                      0x00000007

#define _RPOR4_RP36R_POSITION                    0x00000008
#define _RPOR4_RP36R_MASK                        0x00007F00
#define _RPOR4_RP36R_LENGTH                      0x00000007

#define _RPOR5_RP37R_POSITION                    0x00000000
#define _RPOR5_RP37R_MASK                        0x0000007F
#define _RPOR5_RP37R_LENGTH                      0x00000007

#define _RPOR5_RP38R_POSITION                    0x00000008
#define _RPOR5_RP38R_MASK                        0x00007F00
#define _RPOR5_RP38R_LENGTH                      0x00000007

#define _RPOR6_RP39R_POSITION                    0x00000000
#define _RPOR6_RP39R_MASK                        0x0000007F
#define _RPOR6_RP39R_LENGTH                      0x00000007

#define _RPOR6_RP40R_POSITION                    0x00000008
#define _RPOR6_RP40R_MASK                        0x00007F00
#define _RPOR6_RP40R_LENGTH                      0x00000007

#define _RPOR7_RP41R_POSITION                    0x00000000
#define _RPOR7_RP41R_MASK                        0x0000007F
#define _RPOR7_RP41R_LENGTH                      0x00000007

#define _RPOR7_RP43R_POSITION                    0x00000008
#define _RPOR7_RP43R_MASK                        0x00007F00
#define _RPOR7_RP43R_LENGTH                      0x00000007

#define _RPOR8_RP44R_POSITION                    0x00000000
#define _RPOR8_RP44R_MASK                        0x0000007F
#define _RPOR8_RP44R_LENGTH                      0x00000007

#define _RPOR8_RP45R_POSITION                    0x00000008
#define _RPOR8_RP45R_MASK                        0x00007F00
#define _RPOR8_RP45R_LENGTH                      0x00000007

#define _RPOR9_RP46R_POSITION                    0x00000000
#define _RPOR9_RP46R_MASK                        0x0000007F
#define _RPOR9_RP46R_LENGTH                      0x00000007

#define _RPOR9_RP47R_POSITION                    0x00000008
#define _RPOR9_RP47R_MASK                        0x00007F00
#define _RPOR9_RP47R_LENGTH                      0x00000007

#define _RPOR10_RP48R_POSITION                   0x00000000
#define _RPOR10_RP48R_MASK                       0x0000007F
#define _RPOR10_RP48R_LENGTH                     0x00000007

#define _RPOR10_RP49R_POSITION                   0x00000008
#define _RPOR10_RP49R_MASK                       0x00007F00
#define _RPOR10_RP49R_LENGTH                     0x00000007

#define _RPOR11_RP50R_POSITION                   0x00000000
#define _RPOR11_RP50R_MASK                       0x0000007F
#define _RPOR11_RP50R_LENGTH                     0x00000007

#define _RPOR11_RP51R_POSITION                   0x00000008
#define _RPOR11_RP51R_MASK                       0x00007F00
#define _RPOR11_RP51R_LENGTH                     0x00000007

#define _RPOR12_RP52R_POSITION                   0x00000000
#define _RPOR12_RP52R_MASK                       0x0000007F
#define _RPOR12_RP52R_LENGTH                     0x00000007

#define _RPOR12_RP53R_POSITION                   0x00000008
#define _RPOR12_RP53R_MASK                       0x00007F00
#define _RPOR12_RP53R_LENGTH                     0x00000007

#define _RPOR13_RP54R_POSITION                   0x00000000
#define _RPOR13_RP54R_MASK                       0x0000007F
#define _RPOR13_RP54R_LENGTH                     0x00000007

#define _RPOR13_RP55R_POSITION                   0x00000008
#define _RPOR13_RP55R_MASK                       0x00007F00
#define _RPOR13_RP55R_LENGTH                     0x00000007

#define _RPOR14_RP56R_POSITION                   0x00000000
#define _RPOR14_RP56R_MASK                       0x0000007F
#define _RPOR14_RP56R_LENGTH                     0x00000007

#define _RPOR14_RP57R_POSITION                   0x00000008
#define _RPOR14_RP57R_MASK                       0x00007F00
#define _RPOR14_RP57R_LENGTH                     0x00000007

#define _RPOR15_RP58R_POSITION                   0x00000000
#define _RPOR15_RP58R_MASK                       0x0000007F
#define _RPOR15_RP58R_LENGTH                     0x00000007

#define _RPOR15_RP60R_POSITION                   0x00000008
#define _RPOR15_RP60R_MASK                       0x00007F00
#define _RPOR15_RP60R_LENGTH                     0x00000007

#define _RPOR16_RP61R_POSITION                   0x00000000
#define _RPOR16_RP61R_MASK                       0x0000007F
#define _RPOR16_RP61R_LENGTH                     0x00000007

#define _RPOR16_RP62R_POSITION                   0x00000008
#define _RPOR16_RP62R_MASK                       0x00007F00
#define _RPOR16_RP62R_LENGTH                     0x00000007

#define _RPOR17_RP63R_POSITION                   0x00000000
#define _RPOR17_RP63R_MASK                       0x0000007F
#define _RPOR17_RP63R_LENGTH                     0x00000007

#define _RPOR17_RP64R_POSITION                   0x00000008
#define _RPOR17_RP64R_MASK                       0x00007F00
#define _RPOR17_RP64R_LENGTH                     0x00000007

#define _RPOR18_RP65R_POSITION                   0x00000000
#define _RPOR18_RP65R_MASK                       0x0000007F
#define _RPOR18_RP65R_LENGTH                     0x00000007

#define _RPOR18_RP66R_POSITION                   0x00000008
#define _RPOR18_RP66R_MASK                       0x00007F00
#define _RPOR18_RP66R_LENGTH                     0x00000007

#define _RPOR19_RP67R_POSITION                   0x00000000
#define _RPOR19_RP67R_MASK                       0x0000007F
#define _RPOR19_RP67R_LENGTH                     0x00000007

#define _RPOR19_RP68R_POSITION                   0x00000008
#define _RPOR19_RP68R_MASK                       0x00007F00
#define _RPOR19_RP68R_LENGTH                     0x00000007

#define _RPOR20_RP69R_POSITION                   0x00000000
#define _RPOR20_RP69R_MASK                       0x0000007F
#define _RPOR20_RP69R_LENGTH                     0x00000007

#define _RPOR20_RP70R_POSITION                   0x00000008
#define _RPOR20_RP70R_MASK                       0x00007F00
#define _RPOR20_RP70R_LENGTH                     0x00000007

#define _RPOR21_RP71R_POSITION                   0x00000000
#define _RPOR21_RP71R_MASK                       0x0000007F
#define _RPOR21_RP71R_LENGTH                     0x00000007

#define _RPOR21_RP72R_POSITION                   0x00000008
#define _RPOR21_RP72R_MASK                       0x00007F00
#define _RPOR21_RP72R_LENGTH                     0x00000007

#define _RPOR22_RP73R_POSITION                   0x00000000
#define _RPOR22_RP73R_MASK                       0x0000007F
#define _RPOR22_RP73R_LENGTH                     0x00000007

#define _RPOR22_RP74R_POSITION                   0x00000008
#define _RPOR22_RP74R_MASK                       0x00007F00
#define _RPOR22_RP74R_LENGTH                     0x00000007

#define _RPOR23_RP75R_POSITION                   0x00000000
#define _RPOR23_RP75R_MASK                       0x0000007F
#define _RPOR23_RP75R_LENGTH                     0x00000007

#define _RPOR23_RP76R_POSITION                   0x00000008
#define _RPOR23_RP76R_MASK                       0x00007F00
#define _RPOR23_RP76R_LENGTH                     0x00000007

#define _RPOR24_RP176R_POSITION                  0x00000000
#define _RPOR24_RP176R_MASK                      0x0000007F
#define _RPOR24_RP176R_LENGTH                    0x00000007

#define _RPOR24_RP177R_POSITION                  0x00000008
#define _RPOR24_RP177R_MASK                      0x00007F00
#define _RPOR24_RP177R_LENGTH                    0x00000007

#define _RPOR25_RP178R_POSITION                  0x00000000
#define _RPOR25_RP178R_MASK                      0x0000007F
#define _RPOR25_RP178R_LENGTH                    0x00000007

#define _RPOR25_RP179R_POSITION                  0x00000008
#define _RPOR25_RP179R_MASK                      0x00007F00
#define _RPOR25_RP179R_LENGTH                    0x00000007

#define _RPOR26_RP180R_POSITION                  0x00000000
#define _RPOR26_RP180R_MASK                      0x0000007F
#define _RPOR26_RP180R_LENGTH                    0x00000007

