MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS706/mcu.h
#define _IFS6_PWM6IF_POSITION                    0x00000003
#define _IFS6_PWM6IF_MASK                        0x00000008
#define _IFS6_PWM6IF_LENGTH                      0x00000001

#define _IFS6_PWM7IF_POSITION                    0x00000004
#define _IFS6_PWM7IF_MASK                        0x00000010
#define _IFS6_PWM7IF_LENGTH                      0x00000001

#define _IFS6_PWM8IF_POSITION                    0x00000005
#define _IFS6_PWM8IF_MASK                        0x00000020
#define _IFS6_PWM8IF_LENGTH                      0x00000001

#define _IFS6_AC2IF_POSITION                     0x00000007
#define _IFS6_AC2IF_MASK                         0x00000080
#define _IFS6_AC2IF_LENGTH                       0x00000001

#define _IFS6_AC3IF_POSITION                     0x00000008
#define _IFS6_AC3IF_MASK                         0x00000100
#define _IFS6_AC3IF_LENGTH                       0x00000001

#define _IFS6_AC4IF_POSITION                     0x00000009
#define _IFS6_AC4IF_MASK                         0x00000200
#define _IFS6_AC4IF_LENGTH                       0x00000001

#define _IFS6_ADCAN0IF_POSITION                  0x0000000E
#define _IFS6_ADCAN0IF_MASK                      0x00004000
#define _IFS6_ADCAN0IF_LENGTH                    0x00000001

#define _IFS6_ADCAN1IF_POSITION                  0x0000000F
#define _IFS6_ADCAN1IF_MASK                      0x00008000
#define _IFS6_ADCAN1IF_LENGTH                    0x00000001

#define _IFS7_ADCAN2IF_POSITION                  0x00000000
#define _IFS7_ADCAN2IF_MASK                      0x00000001
#define _IFS7_ADCAN2IF_LENGTH                    0x00000001

#define _IFS7_ADCAN3IF_POSITION                  0x00000001
#define _IFS7_ADCAN3IF_MASK                      0x00000002
#define _IFS7_ADCAN3IF_LENGTH                    0x00000001

#define _IFS7_ADCAN4IF_POSITION                  0x00000002
#define _IFS7_ADCAN4IF_MASK                      0x00000004
#define _IFS7_ADCAN4IF_LENGTH                    0x00000001

#define _IFS7_ADCAN5IF_POSITION                  0x00000003
#define _IFS7_ADCAN5IF_MASK                      0x00000008
#define _IFS7_ADCAN5IF_LENGTH                    0x00000001

#define _IFS7_ADCAN6IF_POSITION                  0x00000004
#define _IFS7_ADCAN6IF_MASK                      0x00000010
#define _IFS7_ADCAN6IF_LENGTH                    0x00000001

#define _IFS7_ADCAN7IF_POSITION                  0x00000005
#define _IFS7_ADCAN7IF_MASK                      0x00000020
#define _IFS7_ADCAN7IF_LENGTH                    0x00000001

#define _IFS7_SPI1EIF_POSITION                   0x0000000C
#define _IFS7_SPI1EIF_MASK                       0x00001000
#define _IFS7_SPI1EIF_LENGTH                     0x00000001

#define _IFS7_SPI2EIF_POSITION                   0x0000000D
#define _IFS7_SPI2EIF_MASK                       0x00002000
#define _IFS7_SPI2EIF_LENGTH                     0x00000001

#define _IFS7_SPI3EIF_POSITION                   0x0000000E
#define _IFS7_SPI3EIF_MASK                       0x00004000
#define _IFS7_SPI3EIF_LENGTH                     0x00000001

#define _IFS8_CLC1IF_POSITION                    0x0000000A
#define _IFS8_CLC1IF_MASK                        0x00000400
#define _IFS8_CLC1IF_LENGTH                      0x00000001

#define _IFS8_CLC2IF_POSITION                    0x0000000B
#define _IFS8_CLC2IF_MASK                        0x00000800
#define _IFS8_CLC2IF_LENGTH                      0x00000001

#define _IFS8_CLC3IF_POSITION                    0x0000000C
#define _IFS8_CLC3IF_MASK                        0x00001000
#define _IFS8_CLC3IF_LENGTH                      0x00000001

#define _IFS8_CLC4IF_POSITION                    0x0000000D
#define _IFS8_CLC4IF_MASK                        0x00002000
#define _IFS8_CLC4IF_LENGTH                      0x00000001

#define _IFS8_ICDIF_POSITION                     0x0000000E
#define _IFS8_ICDIF_MASK                         0x00004000
#define _IFS8_ICDIF_LENGTH                       0x00000001

#define _IFS8_JTAGIF_POSITION                    0x0000000F
#define _IFS8_JTAGIF_MASK                        0x00008000
#define _IFS8_JTAGIF_LENGTH                      0x00000001

#define _IFS9_PTGSTEPIF_POSITION                 0x00000001
#define _IFS9_PTGSTEPIF_MASK                     0x00000002
#define _IFS9_PTGSTEPIF_LENGTH                   0x00000001

#define _IFS9_PTGWDTIF_POSITION                  0x00000002
#define _IFS9_PTGWDTIF_MASK                      0x00000004
#define _IFS9_PTGWDTIF_LENGTH                    0x00000001

#define _IFS9_PTG0IF_POSITION                    0x00000003
#define _IFS9_PTG0IF_MASK                        0x00000008
#define _IFS9_PTG0IF_LENGTH                      0x00000001

#define _IFS9_PTG1IF_POSITION                    0x00000004
#define _IFS9_PTG1IF_MASK                        0x00000010
#define _IFS9_PTG1IF_LENGTH                      0x00000001

#define _IFS9_PTG2IF_POSITION                    0x00000005
#define _IFS9_PTG2IF_MASK                        0x00000020
#define _IFS9_PTG2IF_LENGTH                      0x00000001

#define _IFS9_PTG3IF_POSITION                    0x00000006
#define _IFS9_PTG3IF_MASK                        0x00000040
#define _IFS9_PTG3IF_LENGTH                      0x00000001

#define _IFS9_ADCAN8IF_POSITION                  0x00000007
#define _IFS9_ADCAN8IF_MASK                      0x00000080
#define _IFS9_ADCAN8IF_LENGTH                    0x00000001

#define _IFS9_ADCAN9IF_POSITION                  0x00000008
#define _IFS9_ADCAN9IF_MASK                      0x00000100
#define _IFS9_ADCAN9IF_LENGTH                    0x00000001

#define _IFS9_ADCAN10IF_POSITION                 0x00000009
#define _IFS9_ADCAN10IF_MASK                     0x00000200
#define _IFS9_ADCAN10IF_LENGTH                   0x00000001

#define _IFS9_ADCAN11IF_POSITION                 0x0000000A
#define _IFS9_ADCAN11IF_MASK                     0x00000400
#define _IFS9_ADCAN11IF_LENGTH                   0x00000001

#define _IFS9_ADCAN12IF_POSITION                 0x0000000B
#define _IFS9_ADCAN12IF_MASK                     0x00000800
#define _IFS9_ADCAN12IF_LENGTH                   0x00000001

#define _IFS9_ADCAN13IF_POSITION                 0x0000000C
#define _IFS9_ADCAN13IF_MASK                     0x00001000
#define _IFS9_ADCAN13IF_LENGTH                   0x00000001

#define _IFS9_ADCAN14IF_POSITION                 0x0000000D
#define _IFS9_ADCAN14IF_MASK                     0x00002000
#define _IFS9_ADCAN14IF_LENGTH                   0x00000001

#define _IFS9_ADCAN15IF_POSITION                 0x0000000E
#define _IFS9_ADCAN15IF_MASK                     0x00004000
#define _IFS9_ADCAN15IF_LENGTH                   0x00000001

