MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS706/mcu.h
/* Register FPOR (0x157a4)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FPOR;
#define _FPOR(x) __attribute__((address(0x157a4),deprecated_definition("consider migrating to #pragma config"),section("__FPOR.sec"),space(prog))) __prog__ uint16_t _FPOR = (x);

/*
** Only one invocation of FPOR should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FPOR.
** Multiple options may be combined, as shown:
**
** _FPOR( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
*/

/* Register FICD (0x157a8)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FICD;
#define _FICD(x) __attribute__((address(0x157a8),deprecated_definition("consider migrating to #pragma config"),section("__FICD.sec"),space(prog))) __prog__ uint16_t _FICD = (x);

/*
** Only one invocation of FICD should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FICD.
** Multiple options may be combined, as shown:
**
** _FICD( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   ICD Communication Channel Select bits:
**     ICS_NONE             Reserved, do not use
**     ICS_PGD3             Communicate on PGEC3 and PGED3
**     ICS_PGD2             Communicate on PGEC2 and PGED2
**     ICS_PGD1             Communicate on PGEC1 and PGED1
**
**   JTAG Enable bit:
**     JTAGEN_OFF           JTAG is disabled
**     JTAGEN_ON            JTAG is enabled
**
**   BOOTSWP Instruction Enable/Disable bit:
**     BTSWP_ON             BOOTSWP instruction is enabled
**     BTSWP_OFF            BOOTSWP instruction is disabled
**
*/

#define ICS_NONE             0x80A0
#define ICS_PGD3             0x80A1
#define ICS_PGD2             0x80A2
#define ICS_PGD1             0x80A3

#define JTAGEN_OFF           0x8083
#define JTAGEN_ON            0x80A3

#define BTSWP_ON             0x00A3
#define BTSWP_OFF            0x80A3

/* Register FDEVOPT (0x157ac)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDEVOPT;
#define _FDEVOPT(x) __attribute__((address(0x157ac),deprecated_definition("consider migrating to #pragma config"),section("__FDEVOPT.sec"),space(prog))) __prog__ uint16_t _FDEVOPT = (x);

/*
** Only one invocation of FDEVOPT should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDEVOPT.
** Multiple options may be combined, as shown:
**
** _FDEVOPT( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   PWMx Lock Enable bit:
**     PWMLOCK_OFF          PWM registers may be written without key sequence
**     PWMLOCK_ON           Certain PWM registers may only be written after key sequency
**
**   Alternate I2C1 Pin bit:
**     ALTI2C1_ON           I2C1 mapped to ASDA1/ASCL1 pins
**     ALTI2C1_OFF          I2C1 mapped to SDA1/SCL1 pins
**
**   Alternate I2C2 Pin bit:
**     ALTI2C2_ON           I2C2 mapped to ASDA2/ASCL2 pins
**     ALTI2C2_OFF          I2C2 mapped to SDA2/SCL2 pins
**
**   DACx Output Cross Connection bit:
**     DBCC_ON              Interconnects DACOUT1 and DACOUT2
**     DBCC_OFF             No Cross Connection between DAC outputs
**
*/

#define PWMLOCK_OFF          0x0058
#define PWMLOCK_ON           0x0059

#define ALTI2C1_ON           0x0051
#define ALTI2C1_OFF          0x0059

#define ALTI2C2_ON           0x0049
#define ALTI2C2_OFF          0x0059

#define DBCC_ON              0x0019
#define DBCC_OFF             0x0059

/* Register FALTREG (0x157b0)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FALTREG;
#define _FALTREG(x) __attribute__((address(0x157b0),deprecated_definition("consider migrating to #pragma config"),section("__FALTREG.sec"),space(prog))) __prog__ uint16_t _FALTREG = (x);

/*
** Only one invocation of FALTREG should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FALTREG.
** Multiple options may be combined, as shown:
**
** _FALTREG( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Specifies Interrupt Priority Level (IPL) Associated to Alternate Working Register 1 bits:
**     CTXT1_IPL1           Alternate Register set assigned to IPL level 1
**     CTXT1_IPL2           Alternate Register set assigned to IPL level 2
**     CTXT1_IPL3           Alternate Register set assigned to IPL level 3
**     CTXT1_IPL4           Alternate Register set assigned to IPL level 4
**     CTXT1_IPL5           Alternate Register set assigned to IPL level 5
**     CTXT1_IPL6           Alternate Register set assigned to IPL level 6
**     CTXT1_IPL7           Alternate Register set assigned to IPL level 7
**     CTXT1_OFF            Not Assigned
**
**   Specifies Interrupt Priority Level (IPL) Associated to Alternate Working Register 2 bits:
**     CTXT2_IPL1           Alternate Register set assigned to IPL level 1
**     CTXT2_IPL2           Alternate Register set assigned to IPL level 2
**     CTXT2_IPL3           Alternate Register set assigned to IPL level 3
**     CTXT2_IPL4           Alternate Register set assigned to IPL level 4
**     CTXT2_IPL5           Alternate Register set assigned to IPL level 5
**     CTXT2_IPL6           Alternate Register set assigned to IPL level 6
**     CTXT2_IPL7           Alternate Register set assigned to IPL level 7
**     CTXT2_OFF            Not Assigned
**
**   Specifies Interrupt Priority Level (IPL) Associated to Alternate Working Register 2 bits:
**     CTXT3_IPL1           Alternate Register set assigned to IPL level 1
**     CTXT3_IPL2           Alternate Register set assigned to IPL level 2
**     CTXT3_IPL3           Alternate Register set assigned to IPL level 3
**     CTXT3_IPL4           Alternate Register set assigned to IPL level 4
**     CTXT3_IPL5           Alternate Register set assigned to IPL level 5
**     CTXT3_IPL6           Alternate Register set assigned to IPL level 6
**     CTXT3_IPL7           Alternate Register set assigned to IPL level 7
**     CTXT3_OFF            Not Assigned
**
**   Specifies Interrupt Priority Level (IPL) Associated to Alternate Working Register 2 bits:
**     CTXT4_IPL1           Alternate Register set assigned to IPL level 1
**     CTXT4_IPL2           Alternate Register set assigned to IPL level 2
**     CTXT4_IPL3           Alternate Register set assigned to IPL level 3
**     CTXT4_IPL4           Alternate Register set assigned to IPL level 4
**     CTXT4_IPL5           Alternate Register set assigned to IPL level 5
**     CTXT4_IPL6           Alternate Register set assigned to IPL level 6
**     CTXT4_IPL7           Alternate Register set assigned to IPL level 7
**     CTXT4_OFF            Not Assigned
**
*/

#define CTXT1_IPL1           0x7770
#define CTXT1_IPL2           0x7771
#define CTXT1_IPL3           0x7772
#define CTXT1_IPL4           0x7773
#define CTXT1_IPL5           0x7774
#define CTXT1_IPL6           0x7775
#define CTXT1_IPL7           0x7776
#define CTXT1_OFF            0x7777

#define CTXT2_IPL1           0x7707
#define CTXT2_IPL2           0x7717
#define CTXT2_IPL3           0x7727
#define CTXT2_IPL4           0x7737
#define CTXT2_IPL5           0x7747
#define CTXT2_IPL6           0x7757
#define CTXT2_IPL7           0x7767
#define CTXT2_OFF            0x7777

#define CTXT3_IPL1           0x7077
#define CTXT3_IPL2           0x7177
#define CTXT3_IPL3           0x7277
#define CTXT3_IPL4           0x7377
#define CTXT3_IPL5           0x7477
#define CTXT3_IPL6           0x7577
#define CTXT3_IPL7           0x7677
#define CTXT3_OFF            0x7777

#define CTXT4_IPL1           0x0777
#define CTXT4_IPL2           0x1777
#define CTXT4_IPL3           0x2777
#define CTXT4_IPL4           0x3777
#define CTXT4_IPL5           0x4777
#define CTXT4_IPL6           0x5777
#define CTXT4_IPL7           0x6777
#define CTXT4_OFF            0x7777

